`terraform plan` says:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.prow_deployer_for_prow_build will be created
  + resource "google_project_iam_member" "prow_deployer_for_prow_build" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:prow-deployer@k8s-infra-prow-build-trusted.iam.gserviceaccount.com"
      + project = "k8s-infra-prow-build"
      + role    = "roles/container.developer"
    }

  # google_project_iam_member.prow_deployer_for_prow_build_trusted will be created
  + resource "google_project_iam_member" "prow_deployer_for_prow_build_trusted" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:prow-deployer@k8s-infra-prow-build-trusted.iam.gserviceaccount.com"
      + project = "k8s-infra-prow-build-trusted"
      + role    = "roles/container.developer"
    }

  # google_service_account.prow_deployer_sa will be created
  + resource "google_service_account" "prow_deployer_sa" {
      + account_id   = "prow-deployer"
      + display_name = "prow-deployer"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "k8s-infra-prow-build-trusted"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_policy.prow_deployer_sa_iam will be created
  + resource "google_service_account_iam_policy" "prow_deployer_sa_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + policy_data        = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:k8s-infra-prow-build-trusted.svc.id.goog[test-pods/prow-deployer]",
                        ]
                      + role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        )
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```